ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/pss.xml
<module id="PSS" HW_revision=""><register id="KEY" width="32" offset="0x0" internal="0" description="Key Register"><bitfield id="KEY" description="PSS control key" begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="CTL0" width="32" offset="0x4" internal="0" description="Control 0 Register"><bitfield id="SVSMHOFF" description="SVSM high-side off" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="SVSMHOFF__0" value="0" description="The SVSMH is on"/><bitenum id="SVSMHOFF__1" value="1" description="The SVSMH is off"/></bitfield><bitfield id="SVSMHLP" description="SVSM high-side low power normal performance mode" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="SVSMHLP__0" value="0" description="Full performance mode"/><bitenum id="SVSMHLP__1" value="1" description="Low power normal performance mode in LPM3, LPM4, and LPMx"/></bitfield><bitfield id="SVSMHS" description="Supply supervisor or monitor selection for the high-side" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="SVSMHS__0" value="0" description="Configure as SVSH"/><bitenum id="SVSMHS__1" value="1" description="Configure as SVMH"/></bitfield><bitfield id="SVSMHTH" description="SVSM high-side reset voltage level" begin="5" end="3" width="3" rwaccess="R/W"/><bitfield id="SVMHOE" description="SVSM high-side output enable" begin="6" end="6" width="1" rwaccess="R/W"><bitenum id="SVMHOE__0" value="0" description="SVSMHIFG bit is not output"/><bitenum id="SVMHOE__1" value="1" description="SVSMHIFG bit is output to the device SVMHOUT pin"/></bitfield><bitfield id="SVMHOUTPOLAL" description="SVMHOUT pin polarity active low" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="SVMHOUTPOLAL__0" value="0" description="SVMHOUT is active high"/><bitenum id="SVMHOUTPOLAL__1" value="1" description="SVMHOUT is active low"/></bitfield><bitfield id="SVSLOFF" description="SVS low-side off" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="SVSLOFF__0" value="0" description="The SVSL is on"/><bitenum id="SVSLOFF__1" value="1" description="The SVSL is off"/></bitfield><bitfield id="SVSLLP" description="SVS low-side low power normal performance mode" begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="SVSLLP__0" value="0" description="Full performance mode"/><bitenum id="SVSLLP__1" value="1" description="Low power normal performance mode in LPM3, LPM4, and LPMx"/></bitfield><bitfield id="DCDC_FORCE" description="Disables automatic supply voltage detection and possible denial" begin="10" end="10" width="1" rwaccess="R/W"><bitenum id="DCDC_FORCE__0" value="0" description="Allow DC/DC power mode request to be denied if supply voltage i"/><bitenum id="DCDC_FORCE__1" value="1" description="Disable continuos monitor of supply voltage to see if DC/DC sho"/></bitfield><bitfield id="VCORETRAN" description="Controls VCORE Level Transition time" begin="13" end="12" width="2" rwaccess="R/W"><bitenum id="VCORETRAN__0" value="0" description="32 μs / 100 mV"/><bitenum id="VCORETRAN__1" value="1" description="64 μs / 100 mV"/><bitenum id="VCORETRAN__2" value="2" description="128 μs / 100 mV (default)"/><bitenum id="VCORETRAN__3" value="3" description="256 μs / 100 mV"/></bitfield></register><register id="CTL1" width="32" offset="0x8" internal="0" description="Control 1 Register"><bitfield id="DOCMON" description="Turns the DOCM module on or off" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="DOCMON__0" value="0" description="Disable DOCM"/><bitenum id="DOCMON__1" value="1" description="Enable DOCM"/></bitfield><bitfield id="DOCMSAMP" description="DOCM sample current" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="DOCMSAMP__0" value="0" description="Disable sampling switch inside LDO DOCM"/><bitenum id="DOCMSAMP__1" value="1" description="Enable sampling switch inside LDO DOCM"/></bitfield><bitfield id="DOCMCM" description="Controls current mirrors in DOCM for conversion" begin="8" end="3" width="6" rwaccess="R/W"/></register><register id="CTL2" width="32" offset="0xC" internal="0" description="Control 2 Register"><bitfield id="DOCMOUT" description="DOCM comparator output" begin="5" end="0" width="6" rwaccess="R/W"/></register><register id="IE" width="32" offset="0x34" internal="0" description="Interrupt Enable Register"><bitfield id="SVSMHIE" description="High-side SVSM interrupt enable, when set as a monitor (SVSMHS " begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="SVSMHIE__0" value="0" description="Interrupt disabled"/><bitenum id="SVSMHIE__1" value="1" description="Interrupt enabled"/></bitfield></register><register id="IFG" width="32" offset="0x38" internal="0" description="Interrupt Flag Register"><bitfield id="SVSMHIFG" description="High-side SVSM interrupt flag" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="SVSMHIFG__0" value="0" description="No interrupt pending"/><bitenum id="SVSMHIFG__1" value="1" description="Interrupt due to SVSMH"/></bitfield></register><register id="CLRIFG" width="32" offset="0x3C" internal="0" description="Clear Interrupt Flag Register"><bitfield id="CLRSVSMHIFG" description="SVSMH clear interrupt flag" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="CLRSVSMHIFG__0" value="0" description="No effect"/><bitenum id="CLRSVSMHIFG__1" value="1" description="Clear pending interrupt flag"/></bitfield></register></module>